FSI/two_flap_perp_2D/OpenFOAM-deal.II/Fluid/system/preciceDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      preciceDict;
}

preciceConfig "precice-config.xml";

participant Fluid;

modules (FSI);

interfaces
{
  Interface1
  {
    mesh              Fluid-Mesh-Centers1;
    patches           (flap1);
    locations         faceCenters;
    
    readData
    (
    );
    
    writeData
    (
      Stress1
    );
  };
  
  Interface2
  {
    mesh              Fluid-Mesh-Nodes1;
    patches           (flap1);
    locations         faceNodes;
    
    readData
    (
      Displacement1
    );
    
    writeData
    (
    );
  };
  
  Interface3
  {
    mesh              Fluid-Mesh-Centers2;
    patches           (flap2);
    locations         faceCenters;
    
    readData
    (
    );
    
    writeData
    (
      Stress2
    );
  };
  
  Interface4
  {
    mesh              Fluid-Mesh-Nodes2;
    patches           (flap2);
    locations         faceNodes;
    
    readData
    (
      Displacement2
    );
    
    writeData
    (
    );
  };
};

FSI
{
  rho rho [1 -3 0 0 0 0 0] 1;
}
